using System;
using System.Collections.Generic;
using System.Linq;
using System.Security.RightsManagement;
using System.Text;
using System.Threading.Tasks;

namespace PrinterWPF
{
    class SertificateList
    {
        public string[] sertName =
        {
            "ШМСПД",            "СППТМГШО",         "ППКУП",            "IGRN RMP",
            "IGRN CBOX",        "Микон IV",         "IGRN RMG",         "IGRN ИИП",
            "IGRN RMB",         "ДСР",              "ИИП Пожарный",     "ИП 101-4-PR",
            "ИП-513-1-B",       "ОПС3-2",           "СВР",              "УДП-513-1-B",
            "ИП-513-2-В-485",   "УДП-513-2-В-485",  "ОПС3-1",           "ОПС-1",
            "УСВ",              "ИП 101-2/3",       "ИБПР",             "ИП 329/330",
            "МФРС",             "АСПЗ",             "МФКВ.М",           "МУПТВ",
            "МПП",              "КСИ",              "MP IS (Телефон)",  "МФКВ.РО",
            "АВР РВ",           "АВР РН2",          "АРМ РН2",          "ИПТК",
            "СПСС CWS"
        };

        public string[] sertSerialNumber =
        {
            "ЕАЭС RU C-RU.ME92.B.00083/19",     "ЕАЭС RU C-RU.ME92.B.00084/19",         "TC RU C-RU.ME92.B.01041",          "TC RU C-RU.ME92.B.00959",
            "TC RU C-RU.ME92.B.01079",          "ЕАЭС RU C-RU.HA65.B.00333/19",         "ЕАЭС RU C-RU.ME92.B.00029/19",     "ЕАЭС RU C-RU.ME92.B.00024/19",
            "TC RU C-RU.ME92.B.00958",          "TC RU C-RU.HA65.B.00004",              "ЕАЭС RU C-RU.ME92.B.00034/19",     "ЕАЭС RU C-RU.ME92.B.00085/19",
            "TC RU C-RU.ME92.B.01044",          "RU C-RU.МЮ62.B.01054/19",              "TC RU C-RU.ME92.B.00017/18",       "TC RU C-RU.ME92.B.01043",
            "ЕАЭС RU C-RU.HB07.B.00046/19",     "ЕАЭС RU C-RU.HB07.B.00043/19",         "TC RU C-RU.ME92.B.01013",          "TC RU C-RU.ME92.B.00998",
            "RU C-RU.HB07.B.00060/20",          "RU C-RU.HB07.B.00045/19",              "РОСС RU.EX01.B.00012",             "RU C-RU.HA65.B.00315/19",
            "RU C-RU.HB07.B.00081/20",          "RU C-RU.HB07.B.00052/19",              "RU C-RU.HB07.B.00172/20",          "RU C-RU.ME92.B.01001",
            "RU C-RU.ME92.B.01085",             "TC RU C-RU.ME92.B.00902",              "XX XX X-XX.XXXX.X.XXXXXX/XX",      "RU C-RU.HB07.B.00160/20",
            "RU C-RU.HB07.B.00205/20",          "РОСС RU.EX01.B.00018",                 "РОСС RU.EX01.B.00030",             "RU C-RU.ГБ08.B.01689",
            "RU C-RU.HB07.B.00217/20"
        };

        public string[] sertOrganization =
        {
            "МОС СЕРТИУМ",  "МОС СЕРТИУМ",                  "МОС СЕРТИУМ",                  "МОС СЕРТИУМ",
            "МОС СЕРТИУМ",  "ОС ООО \"ТехБезопасность\"",   "МОС СЕРТИУМ",                  "МОС СЕРТИУМ",
            "МОС СЕРТИУМ",  "ОС ООО \"ТехБезопасность\"",   "МОС СЕРТИУМ",                  "ОС ООО \"ТехБезопасность\"",
            "МОС СЕРТИУМ",  "ПРОММАШ ТЕСТ",                 "МОС СЕРТИУМ",                  "МОС СЕРТИУМ",
            "ПРОФИТЕСТ",    "ПРОФИТЕСТ",                    "МОС СЕРТИУМ",                  "МОС СЕРТИУМ",
            "ПРОФИТЕСТ",    "ПРОФИТЕСТ",                    "НИиНИИ Взрывоопасных сред",    "ОС ООО \"ТехБезопасность\"",
            "ПРОФИТЕСТ",    "ПРОФИТЕСТ",                    "ПРОФИТЕСТ",                    "МОС СЕРТИУМ",
            "МОС СЕРТИУМ",  "МОС СЕРТИУМ",                  "ПРОФИТЕСТ",                    "ПРОФИТЕСТ",
            "ПРОФИТЕСТ",    "НИиНИИ Взрывоопасных сред",    "НИиНИИ Взрывоопасных сред",    "ОС ВО ЗАО ТИБР",
            "ПРОФИТЕСТ"
        };
    }
}
